**** Python / Jupyter
#+begin_src elisp
(after! python
  (setq-default flycheck-disabled-checkers '(python-pylint))
  (add-hook! 'python-mode-hook
             :append (anaconda-mode)
             :append (python-docstring-mode)
             )
  (setq org-babel-default-header-args:jupyter-python '((:session . "*jpy*")
                                                       (:async "yes")
                                                       (:kernel . "python3")
                                                       (:results . "drawer output raw"))))
#+end_src

#+RESULTS:
: ((:session . *jpy*) (:async yes) (:kernel . python3) (:results . drawer output raw))

#+begin_src elisp
(defun +virgile/close-on-already-formatted (FORMATTER STATUS)
  "Closes the format-all window if the document was formatted without any error"
  (let (format-all-window (get-buffer-window "*format-all-errors*"))
    (if (and (member STATUS '(:already-formatted :reformatted))
             format-all-window)
        (delete-window format-all-window))
    )
  )

(after! format-all
  (add-hook! 'format-all-after-format-functions :append +virgile/close-on-already-formatted)
  )

(defun +virgile/setup-org-jupyter nil
  "Avoid emacs-jupyter / ob-async incompatibility"
  (interactive)
  (setq ob-async-no-async-languages-alist '("jupyter-python"))
  )
#+end_src

#+RESULTS:
: +virgile/setup-org-jupyter

#+begin_src elisp
(after! poetry
  (setq poetry-tracking-strategy 'projectile))
#+end_src

#+RESULTS:
: projectile

***** General
This does a few things:
- change the agenda files to point to the org-roam files
- create a default file for notes
- indent org files, number headers, and turn on visual line mode
- display inline images

#+begin_src elisp
3
#+end_src

#+RESULTS:
: 3

#+begin_src elisp
(setq org-confirm-babel-evaluate nil
      org-agenda-files '("~/org/roam")
      org-hide-emphasis-markers t
      org-default-notes-file (expand-file-name "~/org/notes.org")
      org-hide-leading-stars nil)
(add-hook! 'org-mode-hook
           #'org-num-mode
           #'visual-line-mode)
(add-hook! 'org-mode-hook
  (display-line-numbers-mode 0)
  (highlight-indent-guides-mode 0)
  (hl-line-mode 0))
#+end_src

#+begin_src elisp
(after! mixed-pitch
  (setq mixed-pitch-set-height t))
#+end_src

Setup headlines fonts to use the ETBembo family and decreasing size.

#+begin_src elisp
(after! org
  (custom-set-faces!
    ;; `(org-level-1 :inherit outline-1
    ;;               :family "ETBembo" :height 1.4
    ;;               :weight normal :slant normal
    ;;               :foreground ,(doom-color 'fg)
    ;;               :box (:line-width 3 :color ,(doom-color 'bg)))
    ;; `(org-level-2 :inherit variable-pitch
    ;;               :family "ETBembo" :height 1.3
    ;;               :weight normal :slant normal
    ;;               :foreground ,(doom-color 'fg)
    ;;               :box (:line-width 1 :color ,(doom-color 'bg)))
    ;; `(org-level-3 :inherit variable-pitch :family "ETBembo" :height 1.2 :weight normal :slant normal :foreground ,(doom-color 'fg))
    ;; `(org-level-4 :inherit variable-pitch :family "ETBembo" :height 1.2 :weight normal :slant italic :foreground ,(doom-color 'fg))
    ;; `(org-level-5 :inherit variable-pitch :family "ETBembo" :height 1.1 :weight normal :slant italic :foreground ,(doom-color 'fg))
    ;; `(org-level-6 :inherit variable-pitch :family "ETBembo" :height 1.0 :weight normal :slant italic :foreground ,(doom-color 'fg))
    ;; `(org-level-7 :inherit variable-pitch :family "ETBembo" :height 1.0 :weight normal :slant italic :foreground ,(doom-color 'fg))
    ;; `(org-level-8 :inherit variable-pitch :family "ETBembo" :height 1.0 :weight normal :slant italic :foreground ,(doom-color 'fg))
    `(org-block-begin-line :slant normal)
    `(org-block-end-line :slant normal)
    ;; `(org-superstar-header-bullet :foreground ,(doom-color 'grey))
    `(org-num-face :height 1.0)
    `(org-drawer :inherit org-block :background ,(doom-color 'bg) :foreground ,(doom-color 'blue))))
#+end_src

#+RESULTS:
| doom--customize-themes-h-13 | doom--customize-themes-h-784 | doom--customize-themes-h-785 |

**** Elfeed
#+begin_src elisp
(after! elfeed
  (elfeed-score-enable)
  (setq-default elfeed-search-filter "@3-days-ago -finance +unread")
  (map! :map elfeed-show-mode-map
        "a" #'pocket-reader-add-link)
  (map! :map elfeed-search-mode-map
        "a" #'pocket-reader-add-link)
  (add-hook! 'elfeed-show-mode-hook #'variable-pitch-mode))
#+end_src

#+RESULTS:
| variable-pitch-mode | doom--setq-shr-external-rendering-functions-for-elfeed-show-mode-h | doom--setq-shr-put-image-function-for-elfeed-show-mode-h | +rss-elfeed-wrap-h |

#+begin_src elisp
(after! elfeed-score
  (setq elfeed-score-serde-score-file (expand-file-name "~/.config/elfeed.score"))
;  (setq elfeed-search-print-entry-function #'elfeed-score-print-entry)
  (define-key elfeed-search-mode-map "=" elfeed-score-map))
#+end_src

Scoring file for =elfeed-score=:
#+begin_src elisp :tangle ~/.config/elfeed.score
(("title-or-content"
  (:text "mlops" :title-value 200 :content-value 100 :type w)
  (:text "deploy" :title-value 100 :content-value 50 :type w)
  (:text "ml" :title-value 100 :content-value 50 :type w)
  (:text "machine learning" :title-value 100 :content-value 50 :type w)
  (:text "data" :title-value 100 :content-value 50 :type w)
  (:text "APIs?" :title-value 100 :content-value 50 :type R)
  (:text "python" :title-value 200 :content-value 100 :type w)
  (:text "emacs" :title-value 100 :content-value 50 :type w)
  (:text "covid" :title-value -100 :content-value -50 :type w)
  (:text "coronavirus" :title-value -100 :content-value -50 :type w)
  (:text "N.B.A." :title-value -50 :content-value -50 :type W)
  (:text "M.L.B." :title-value -200 :content-value -100 :type W)
  (:text "Trump" :title-value -200 :content-value -100 :type W)
  (:text "Biden\(.?s\)?" :title-value -50 :content-value -10 :type R)
  (:text "\\[\\(europe\\|asia\\|middleeast\\) region\\]" :title-value -1000 :content-value -1000 :type r)
  (:text "@FTLex" :title-value -1000 :content-value -1000 :type W)
  (:text "open thread" :title-value -200 :content-value -100 :type w)
  (:text "search results" :title-value -1000 :content-value -1000 :type W))
 (mark -100))
#+end_src
**** Zen mode
Turn off text zooming
#+begin_src elisp
(setq +zen-text-scale 0)
#+end_src

#+RESULTS:
: 0

Increase width
#+begin_src elisp
(setq writeroom-width 120)
#+end_src

